import React from "react";
import { Dimensions } from "react-native";

export const WINDOW_WIDTH = Dimensions.get("window").width;
//스크린 너비 초기화 => WINDOW_WIDTH
export const WINDOW_HEIGHT = Dimensions.get("window").height;
//스크린 높이 초기화=> WINDOW_HEIGHT 로 property라는 파일이나 폴더로 많이 쓴다.
export const MindTextIntroductionText = [
  "효준님의 마음은 지금 어둡고 외로워 보이네요.",
  "평소에는 괜찮은 것 같다가도, 이따금 가슴이 답답하고 가라앉는 느낌이 드실 거예요.",
  "괜찮아요.여기 효준님의 외로움을 담은 마음 씨앗을 받으세요.",
  "앞으로 14일 동안, 효준님이 이 씨앗을 키우게 됩니다.",
  "14일 후, 이 화분엔 어떤 꽃이 자라게 될까요?",
];

export const questionObj = {
  1: `평소에 아무렇지 않게 하던 일들이 \n귀찮게 느껴졌어요.`,
  2: "입맛이 없었어요",
  3: `가족이나 친구가 도와줘도 \n울적한 기분을 떨칠 수 없었어요.`,
  4: `무슨 일을 하든 \n정신을 집중하기가 힘들었어요.`,
  5: "특별히 힘들지 않았어요",
  6: "기분이 상당히 우울했어요.",
  7: "하는 일마다 어렵게 느껴졌어요.",
  8: "앞일이 암담하게 느껴졌어요.",
  9: `지금까지의 내 인생은 \n실패라는 생각이 들었어요.`,
  10: "적어도 다른 사람들만큼은 해냈어요.",
  11: "잠을 잘 자지 못했어요.",
  12: "알 수 없는 두려움을 느꼈어요.",
  13: "평소에 비해 말수가 줄었어요.",
  14: `세상에 홀로 있는 듯 \n외로움을 느꼈어요.`,
  15: "큰 불만 없이 생활했어요.",
  16: `사람들이 나에게 \n차갑게 대하는 것 같았어요.`,
  17: "갑자기 울음이 나왔어요",
  18: "잘 있다가도 문득 슬퍼졌어요.",
  19: `사람들이 나를 \n싫어하는 것 같았어요.`,
  20: `도무지 뭘 해나갈 \n엄두가 나지 않았어요.`,
};
